Спортклуб/src/Documents/ПродажаАбонемента/ПродажаАбонемента.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПродажаАбонемента</name>
  <registerRecords>AccumulationRegister.УчетПосещаемости</registerRecords>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>КлубнаяКарта</name>
    <type>
      <types>CatalogRef.КлубныеКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Абонементы</name>
    <attributes>
      <name>ВидАбонемента</name>
      <type>
        <types>CatalogRef.ВидыАбонементов</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоПосещений</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Тренер</name>
      <type>
        <types>CatalogRef.Тренеры</types>
      </type>
    </attributes>
    <attributes>
      <name>Услуга</name>
      <type>
        <types>CatalogRef.Услуги</types>
      </type>
    </attributes>
    <attributes>
      <name>ОграниченаДлительность</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>МесяцевДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДнейДлительность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Групповой</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.ГруппыСпортсменов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДоступноеКоличествоЗаморозок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Спортклуб/src/AccumulationRegisters/УчетПосещаемости/УчетПосещаемости.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>УчетПосещаемости</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>КоличествоПосещений</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Абонемент</name>
    <type>
      <types>CatalogRef.ВидыАбонементов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Спортклуб/src/Documents/ПродажаАбонемента/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Для Каждого Стр из Абонементы Цикл
		Абонемент = Стр.ВидАбонемента;
		КоличествоПосещений = Стр.КоличествоПосещений;
	КонецЦикла; 
	
	Движения.УчетПосещаемости.Записывать = Истина;
	Движение = Движения.УчетПосещаемости.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Абонемент = Абонемент;
	Движение.Период = Дата;
	Движение.Спортсмен = Спортсмен;
	Движение.КоличествоПосещений = КоличествоПосещений;
КонецПроцедуры
